chromium
wox
putty
PuTTY.PuTTY
GitHub.cli
vscode
Python
vim.vim
GNU.Emacs
ImageMagick.ImageMagick
Docker.DockerDesktop
Zoom.Zoom
Oracle.JavaRuntimeEnvironment
winget install IrfanSkiljan.IrfanView
Valve.Steam
Notepad++.Notepad++
Ghisler.TotalCommander
winget install SlackTechnologies.Slack
Microsoft.TeamsExploration
Microsoft.WindowsTerminal
winget install -e --id OpenJS.NodeJS.LTS
Amazon.AWSCLI
Zeit.Hyper
7zip.7zip
AnyDeskSoftwareGmbH.AnyDesk
BraveSoftware.BraveBrowser
Microsoft.dotNetFramework
Microsoft.dotnet
Oracle.VirtualBox
TorProject.TorBrowser
NordVPN.NordVPN
7zip.7zip
mcmilk.7zip-zstd
Telegram.TelegramDesktop
OpenWhisperSystems.Signal
Xming.Xming
Greenshot.Greenshot
OpenVPNTechnologies.OpenVPNConnect
winget install -e --id Discord.Discord
winget install -e --id Yarn.Yarn
winget install -e --id Mozilla.Firefox
winget install -e --id Mozilla.Firefox.DeveloperEdition
ProtonTechnologies.ProtonVPN
winget install -e --id ExpressVPN.ExpressVPN
winget install -e --id Inkscape.Inkscape
winget install -e --id Microsoft.PowerToys
winget install -e --id NurgoSoftware.AquaSnap
winget install -e --id Microsoft.VisualStudioCode
winget install -e --id BinaryFortress.DisplayFusion
winget install -e --id TorProject.TorBrowser
winget install -e --id JetBrains.IntelliJIDEA.Ultimate
winget install -e --id flux.flux
winget install -e --id Opera.Opera
winget install -e --id Opera.OperaGX
winget install -e --id AntibodySoftware.WizTree
winget install -e --id ArtifexSoftware.GhostScript
winget install -e --id WhatsApp.WhatsApp
winget install -e --id vim.vim
winget install -e --id GNU.Emacs
winget install wsltty
winget install -e --id msys2.msys2
winget install -e --id GitHub.GitLFS
winget install -e --id scottlerch.hosts-file-editor
winget install -e --id Streamlink.Streamlink
winget install -e --id VideoLAN.VLC
winget install -e --id Google.CloudSDK
winget install -e --id Google.EarthPro
winget install -e --id Google.EarthPro
winget install -e --id TIDALMusicAS.TIDAL
winget install -e --id Amazon.Kindle
winget install -e --id Amazon.SendToKindle
winget install -e --id Autodesk.sketchbook
winget install -e --id IObit.DriverBooster9
winget install -e --id IObit.IObitSysInfo
winget install -e --id IObit.AdvancedSystemCare
winget install -e --id Files-Community.Files
winget install -e --id TranslucentTB.TranslucentTB
winget install -e --id Lexikos.AutoHotkey
winget install -e --id GIMP.GIMP
winget install -e --id SublimeHQ.SublimeText.3
winget install -e --id Microsoft.WindowsTerminal.Preview
winget install -e --id Alacritty.Alacritty
