# TODO (antoni): This Brewfile may be incomplete.
# It should be generated by populating it with Homebrew packages listed in dotfiles/mac/brew_install.sh

tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "vitorgalvao/tiny-scripts"

brew "ack"
brew "emacs"
brew "agda"
brew "ant"
brew "autoconf"
brew "automake"
brew "xz"
brew "python"
brew "aws-shell"
brew "awscli"
brew "axel"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bison"
brew "calc"
brew "ccat"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "dark-mode"
brew "docker-machine"
brew "dockutil"
brew "dos2unix"
brew "duti"
brew "jpeg"
brew "erlang"
brew "lame"
brew "ffmpeg"
brew "flex"
brew "gawk"
brew "geoip"
brew "ghostscript"
brew "git"
brew "git-crypt"
brew "git-flow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphicsmagick"
brew "grip"
brew "groovy"
brew "hstr"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "iproute2mac"
brew "irssi"
brew "jasmin"
brew "jflex"
brew "node"
brew "jhipster"
brew "jmeter"
brew "jpegoptim"
brew "jq"
brew "lftp"
brew "libpcap"
brew "librsvg"
brew "links"
brew "llvm"
brew "lnav"
brew "lsd"
brew "lynx"
brew "mackup"
brew "mas"
brew "maven"
brew "midnight-commander"
brew "protobuf"
brew "mitmproxy"
brew "mongodb"
brew "mysql"
brew "ncdu"
brew "nginx"
brew "nmap"
brew "nvm"
brew "optipng"
brew "osquery"
brew "p7zip"
brew "parallel"
brew "tree"
brew "pass"
brew "pstree"
brew "pwgen"
brew "qemu"
brew "r"
brew "rabbitmq"
brew "radare2"
brew "ranger"
brew "rlwrap"
brew "sbt"
brew "sox"
brew "speedtest-cli"
brew "svg2png"
brew "svgo"
brew "tcl-tk"
brew "telnet"
brew "tig"
brew "tldr"
brew "tmate"
brew "tmux"
brew "transmission"
brew "unrar"
brew "vim"
brew "vimpager"
brew "watch"
brew "watchman"
brew "webkit2png"
brew "wget"
brew "wireshark"
brew "yarn"
brew "youtube-dl"
brew "dart-lang/dart/dart"
brew "vitorgalvao/tiny-scripts/cask-repair"

cask "alfred"
cask "android-sdk"
cask "android-studio"
cask "atext"
cask "atom"
cask "blue-jeans"
cask "caffeine"
cask "cleanmymac"
cask "clion"
cask "db-browser-for-sqlite"
cask "dropbox"
cask "eclipse-jee"
cask "elmedia-player"
cask "epic"
cask "evernote"
cask "firefox"
cask "flux"
cask "gimp"
cask "gitkraken"
cask "google-drive-file-stream"
cask "google-earth-pro"
cask "gpg-suite"
cask "grammarly"
cask "hyper"
cask "intel-haxm"
cask "java"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keybase"
cask "kindle"
cask "kitematic"
cask "libreoffice"
cask "macdown"
cask "macpass"
cask "macs-fan-control"
cask "mactex"
cask "macvim"
cask "mounty"
cask "mysqlworkbench"
cask "nordvpn"
cask "omnigraffle"
cask "opera"
cask "osxfuse"
cask "owasp-zap"
cask "postman"
cask "pref-setter"
cask "private-eye"
cask "pym-player"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quip"
cask "robo-3t"
cask "rowanj-gitx"
cask "rstudio"
cask "sequel-pro"
cask "signal"
cask "skitch"
cask "skype"
cask "slack"
cask "soda-player"
cask "spectacle"
cask "spotifree"
cask "sublime"
cask "texshop"
cask "the-unarchiver"
cask "tor-browser"
cask "transmission"
cask "transmission-remote-gui"
cask "tunnelblick"
cask "veracrypt"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "vlc-webplugin"
cask "webpquicklook"
cask "webstorm"
cask "whatsapp"
cask "wireshark-chmodbpf"
cask "wkhtmltopdf"
cask "xquartz"
cask "zoom"
cask "zoomus"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-fira-mono"
cask "caskroom/fonts/font-fira-mono-for-powerline"
cask "caskroom/fonts/font-fira-sans"
cask "caskroom/fonts/font-hasklig"
cask "caskroom/fonts/font-inconsolata"
cask "caskroom/fonts/font-menlo-for-powerline"
cask "caskroom/fonts/font-monoid"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/versions/firefox-developer-edition"
cask "caskroom/versions/google-chrome-canary"
cask "caskroom/versions/iterm2-nightly"
cask "caskroom/versions/opera-developer"
cask "caskroom/versions/safari-technology-preview"

mas "Amphetamine", id: 937984704
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "Todoist", id: 585829637
mas "Microsoft Remote Desktop 8", id: 715768417
# mas "Numbers", id: 409203825
# mas "Keynote", id: 409183694
# mas "Pages", id: 409201541
